import React from "react";
import { Button, View } from "react-native";
import { Text } from "react-native-paper";

function AboutDepartment() {
  return (
    <View style={{
      paddingVertical: 20
    }}>
      <Text variant="headlineMedium">Про кафедру</Text>
      <Text variant="headlineSmall">Кафедра «Програмне забезпечення автоматизованих систем»</Text>
      <Text variant="labelLarge">
        Кафедра «Програмного забезпечення автоматизованих систем» створена у 1998 році в результаті реорганізації
        кафедри «Обчислювальної техніки» та організації факультету ФІТІС, якому вона належить. Кафедра є випусковою зі
        спеціальності 121– «Інженерія програмногозабезпечення».</Text>
      <Text variant="labelLarge">Інженерія програмного забезпечення – це дисципліна, яка пов’язана зі всіма аспектами
        виробництва програмного забезпечення від початкових стадій створення специфікації до підтримки системи після
        здачі в експлуатацію.</Text>

      <Text variant="labelLarge"> Освіта в сфері інженерії програмного забезпечення – це розумна інвестиція у своє
        майбутнє. У нас Ви навчитеся не просто програмувати (кодувати), а створювати програмні продукти – аналізувати
        вимоги, працювати в командні розробників, тестувати та забезпечувати якість продукту, керувати програмними
        проектами.</Text>
      <Text variant="labelLarge">Кінець. Розходимось дітки!</Text>
    </View>
  );
}

export default AboutDepartment;
